# Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные. 
# Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
from log import journal_print, journal_sort, print_result

journal=[]
journal_print(journal)
journal_sort(journal)
print_result(journal)






